Repository: montymobile1/montyesim-eshop-SDK-iOS
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, fr

source: Hurray!
ar: مرحى!
fr: Hourra !

# iccid_error
source: ICCID Not Found
ar: لم يتم العثور على ICCID
fr: ICCID introuvable

source: ICCID Number
ar: رقم ICCID
fr: Numéro ICCID

# iccidnumber.title
source: ICCID Number
ar: رقم ICCID
fr: Numéro ICCID

source: Image saved
ar: تم حفظ الصورة بنجاح
fr: Image enregistrée

# Incorrect_pin_code
source: Incorrect pin code. Please try again!
ar: رمز PIN غير صحيح. حاول مرة أخرى!
fr: Code PIN incorrect. Veuillez réessayer !

# install.title
source: Install Now
ar: تثبيت الآن
fr: Installer maintenant

source: Install your eSIM
ar: قم بتثبيت شريحة eSIM الخاصة بك
fr: Installer votre eSIM

source: invalid Amount
ar: مبلغ غير صالح

# Invalid_bundle
source: Invalid Bundle Code or ICCID
ar: رمز الباقة أو ICCID غير صالح
fr: Code de forfait ou ICCID invalide

source: Invalid input data
ar: بيانات الإدخال غير صالحة
fr: Données saisies invalides

source: Invalid Inputs
ar: بيانات غير صحيحة
fr: Données invalides

source: Invalid phone number
ar: رقم الهاتف غير صالح
fr: Numéro de téléphone invalide

source: Invalid URL
ar: رابط غير صالح
fr: URL invalide

# invalidNumberMessage
source: Mobile number is invalid
ar: رقم الجوال غير صالح
fr: Le numéro de mobile est invalide

# InvalidPromo.message
source: Invalid Promo Code
ar: رمز الترويج غير صالح
fr: Code promo invalide

# is_required_field
source: Field is required.
ar: مطلوب
fr: Le champ est obligatoire.

# item.price
source: Unit Price
ar: سعر الوحدة
fr: Prix unitaire

source: Keep Editing
ar: مواصلة التعديلات
fr: Continuer la modification

# landpage.items.countries
source: Countries
ar: البلدان
fr: Pays

# landpage.items.global
source: Global
ar: العالم

# landpage.items.regions
source: Regions
ar: المناطق
fr: Régions

source: Language
ar: اللغة
fr: Langue

# language.title
source: Language
ar: اللغة
fr: Langue

# last_purchase
source: Last Purchased
ar: آخر شراء
fr: Dernier achat

# lastpurchased.title
source: Last Purchased
ar: آخر شراء
fr: Dernier achat

# LastPurchased.title
source: Last Purchased
ar: آخر شراء
fr: Dernier achat

# length_validation_message
source: should be at least
ar: ينبغي أن يكون
fr: doit contenir au moins

# Loading.title
source: loading
ar: جاري التحميل
fr: chargement

# loadingView_contentText
source: The QR Code is being generated. This may take a while...
ar: يتم الأن إنشاء رمز الاستجابة السريعة هذا قد يستغرق بعض الوقت...
fr: Le code QR est en cours de génération. Cela peut prendre un moment...

# login.required.message
source: Login required to purchase this bundle
ar: تسجيل الدخول مطلوب لشراء هذه الحزمة
fr: Connexion requise

# login.requried.title
source: Login required
ar: تسجيل الدخول
fr: Connexion requise

# login.title
source: Log in/Sign up
ar: تسجيل الدخول / إنشاء حساب
fr: Connexion/Inscription

# LogIn.title
source: Log in
ar: تسجيل الدخول
fr: Connexion

# loginView_continueWithApple
source: Continue with Apple
ar: المتابعة عبر Apple
fr: Continuer avec Apple

# loginView_continueWithEmail
source: Continue with Email
ar: المتابعة عبر البريد الإلكتروني
fr: Continuer avec Email

# loginView_continueWithFacebook
source: Continue with Facebook
ar: المتابعة عبر Facebook
fr: Continuer avec Facebook

# loginView_continueWithGoogle
source: Continue with Google
ar: المتابعة عبر Google
fr: Continuer avec Google

# loginView_continueWithPhone
source: Continue with Phone Number
ar: المتابعة باستخدام رقم الهاتف
fr: Continuer avec le numéro de téléphone

# loginView_subTitleText
source: Our App allows you to buy international eSIM profiles & data bundles wherever you are
ar: تطبيقنا يسمح لك بشراء شريحة إلكترونية دولية وحزم بيانات أينما كنت
fr: Notre application vous permet d’acheter des profils eSIM internationaux et des forfaits data où que vous soyez

# loginView_termsFirstText
source: By registering, you accept our
ar: من خلال التسجيل تقبل
fr: En vous inscrivant, vous acceptez nos

# loginView_termsSecondText
source: ,and agree to receive newsletters and promotions
ar: ، وتوافق على تلقي النشرات الاخبارية و العروض الترويجية
fr: et acceptez de recevoir des newsletters et des promotions

# loginView_termsText
source: terms and conditions
ar: الشروط ولاحكام الخاصة بنا
fr: conditions générales

# loginView_titleText
source: Stay connected at sea!
ar: ابقَ على اتصال في البحر!
fr: Restez connecté en mer !

# logout_buttonTitleText
source: Yes, Logout
ar: نعم، تسجيل الخروج
fr: Oui, déconnexion

# logout_contentText
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# logout_titleText
source: Logout
ar: تسجيل الخروج
fr: Déconnexion

# logout.message
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fr: Êtes-vous sûr de vouloir vous déconnecter?

# Logout.title
source: Logout
ar: تسجيل الخروج
fr: Déconnexion

# Message.title
source: Message
ar: رسالة

# metadata_notadded
source: Could not add metadata output
ar: تعذّر إضافة مخرجات البيانات الوصفية
fr: Impossible d’ajouter la sortie des métadonnées

source: minute
ar: دقيقة

source: minutes
ar: دقائق

source: Mobile number
ar: رقم الهاتف
fr: Numéro de mobile

# multipleCountries.title
source: multiple Countries
ar: دول متعددة
fr: plusieurs pays

# myEsim_tabName
source: My eSIM
ar: شريحة eSIM الخاصة بي
fr: Mon eSIM

# myESim_titleText
source: My eSIM
ar: شريحة eSIM الخاصة بي
fr: Mon eSIM

# myesim.title
source: My eSim
ar: شريحتي الالكترونيه
fr: Mon eSim

# myWallet_availableBalanceText
source: Available balance
ar: الرصيد المتاح
fr: Solde disponible

# myWallet_cashbackSectionText
source: Cash Back Rewards
ar: مكافآت الاسترداد النقدي
fr: Récompenses cashback

# myWallet_referSectionText
source: Refer & Earn
ar: قم بالإحالة واكسب
fr: Parrainez et gagnez

# myWallet_rewardsSectionText
source: Rewards History
ar: سجل المكافآت
fr: Historique des récompenses

# myWallet_upgradeSectionText
source: Upgrade Wallet
ar: ترقية المحفظة
fr: Recharger le portefeuille

# myWallet_voucherSectionText
source: Voucher Code
ar: كود القسيمة
fr: Code de bon

# myWallet.title
source: My Wallet
ar: محفظتي
fr: Mon portefeuille

source: Name cannot be empty
ar: لا يمكن ترك الاسم فارغًا
fr: Le nom ne peut pas être vide

# name.title
source: bundle name
ar: اسم الحزمة
fr: nom du forfait

# No Faqs found
source: No Data Found
ar: لم يتم العثور على بيانات.
fr: Aucune donnée

source: No Active eSIM
ar: لا توجد شريحة eSIM نشطة
fr: Aucune eSIM active

# no_active_eSim_description
source: You currently do not have any active eSIM. Select one from our plans to enjoy a seamless experience.
ar: ليس لديك حاليًا أي eSIM نشطة. حدد إحدى الباقات للاستمتاع بتجربة سلسة!
fr: Vous n’avez actuellement aucune eSIM active. Sélectionnez-en une parmi nos forfaits pour profiter d’une expérience fluide.

source: No data received
ar: لم يتم استلام أي بيانات
fr: Aucune donnée reçue

source: No Expired eSIM
ar: لا توجد شريحة eSIM منتهية الصلاحية
fr: Aucune eSIM expirée

# no_expired_eSim_description
source: You currently do not have any expired eSIM. Select one from our plans to enjoy a seamless experience.
ar: ليس لديك حاليًا أي eSIM نشطة. حدد إحدى الباقات للاستمتاع بتجربة سلسة!
fr: Vous n’avez actuellement aucune eSIM expirée. Sélectionnez-en une parmi nos forfaits pour profiter d’une expérience fluide.

# no_payment_method_available
source: No payment method available right now
ar: لا توجد طريقة دفع متاحة حالياً
fr: Aucun moyen de paiement disponible pour le moment

# no_sufficient_balance_in_wallet
source: No Sufficient Balance in your Wallet
ar: لا يوجد رصيد كافٍ في محفظتك
fr: Solde insuffisant dans votre portefeuille

# no.active.eSIM.message
source: You currently do not have any active eSIM. Select one from our plans to enjoy a seamless experience!
ar: ليس لديك حاليًا أي eSIM نشطة. حدد إحدى الباقات للاستمتاع بتجربة سلسة!
fr: Vous n'avez pas d'eSIM active. Choisissez un forfait!

# no.active.eSIM.title
source: No active eSIM
ar: لا توجد شريحة eSIM نشطة
fr: Aucune eSIM active

# no.expired.eSIM.message
source: You currently do not have any expired eSIM. Select one from our plans to enjoy a seamless experience!
ar: ليس لديك حاليًا أي eSIM نشطة. حدد إحدى الباقات للاستمتاع بتجربة سلسة!
fr: Vous n'avez pas d'eSIM expirée.

# no.expired.eSIM.title
source: No Expired eSIM
ar: لا توجد شريحة eSIM منتهية الصلاحية
fr: Aucune eSIM expirée

# no.notification.message
source: couldn’t find any notifications
ar: ليس لديك أي إشعارات حتى الآن

# no.notification.title
source: No notifications
ar: ليس لديك إشعارات
fr: Aucune notification

# no.orders.message
source: No orders found
ar: لم يتم العثور على طلبات.
fr: Aucune commande

# no.orders.title
source: Orders
ar: طلبات
fr: Commandes

# no.qr.code.avaliable
source: No QR code available
ar: لا يوجد رمز QR متاح
fr: Aucun code QR

# no.rewards.message
source: You haven't earned any rewards yet. Start referring your friends to get rewarded!
ar: لم تحصل على أي مكافأة حتى الآن. ابدأ بإحالة الأصدقاء للحصول على مكافأة!
fr: Aucune récompense. Parrainez des amis!

# no.rewards.title
source: No rewards yet
ar: لا توجد مكافآت حتى الآن
fr: Aucune récompense

# no.title
source: No
ar: لا

# no.topup.eSIM.message
source: No topup found
ar: لم يتم العثور على إعادة شحن.

# no.topup.eSIM.title
source: No topup
ar: لا إعادة شحن

# nobundles.message
source: No eSIM bundles found for %@
ar: لم يتم العثور على حزم eSIM لـ %@

# nobundles.title
source: No Bundles Available
ar: لا توجد حزم متاحة

# noConnection_buttonTitleText
source: Go to My eSim
ar: الانتقال إلى شريحة eSIM
fr: Aller à mon eSIM

# noConnection_contentText
source: Please connect to network and try again
ar: يُرجى الاتصال بالشبكة وإعادة المحاولة
fr: Veuillez vous connecter au réseau et réessayer

# noConnection_titleText
source: No Network
ar: لا توجد شبكة
fr: Pas de réseau

# nocruise.title
source: No Cruise Found
ar: لا توجد حزم متاحة

source: No data available yet
ar: لا توجد بيانات متاحة حتى الآن
fr: Aucune donnée disponible pour le moment

# nofaqs.message
source: No Faqs found
ar: لم يتم العثور على أسئلة شائعة.

# noPayments.title
source: No Payment Methods Found
ar: لم يتم العثور على طرق دفع.

source: Not available
ar: غير متوفرة
fr: Non disponible

source: Not Implemented Yet
ar: غير متوفر بعد
fr: Pas encore disponible

# notification.title
source: Notifications
ar: الإشعارات

# notificationView_emptyTitle
source: You do not have any notifications yet
ar: ليس لديك أي إشعارات حتى الآن
fr: Vous n’avez pas encore de notifications

# notificationView_title
source: Notifications
ar: الإشعارات

# notNow.title
source: Not Now
ar: ليس الآن

# ok.title
source: Ok
ar: موافق

# onBoarding_ConfigurationError
source: Configuration Error
ar: حدث خطأ في الإعداد
fr: Erreur de configuration

# oncruise.title
source: On Cruises & Ferry
ar: على الرحلات البحرية والعبّارات

# one_week_ago
source: 1 week ago
ar: الاسبوع الماضي
fr: Il y a 1 semaine

# onland.title
source: OnLand
ar: على اليابسة

source: Open Settings
ar: أفتح الإعدادات
fr: Ouvrir les paramètres

source: Order Id
ar: معرّف الطلب
fr: Numéro de commande

# orderBottomSheet_orderID
source: Order ID
ar: معرّف الطلب
fr: ID de commande

# orderBottomSheet_orderStatus
source: Order Status
ar: حالة الطلب
fr: Statut de la commande

# orderBottomSheet_paymentDetails
source: Payment Details
ar: تفاصيل الدفع
fr: Détails du paiement

# orderBottomSheet_viewReceipt
source: View Receipt
ar: عرض الفاتورة
fr: Voir le reçu

# orderHistory_bundleValidityText
source: Validity
ar: الصلاحية
fr: Validité

# orderHistory_emptyContentText
source: You haven’t ordered anything yet. All order details will appear here once you have.
ar: أنت لم تطلب أي شيء بعد. ستظهر جميع تفاصيل الطلب هنا بمجرد قيامك بذلك.
fr: Vous n’avez encore rien commandé. Tous les détails de vos commandes apparaîtront ici une fois que vous en aurez passé.

# orderHistory_emptyTitleText
source: No order history yet
ar: لا يوجد سجل الطلب حتى الآن
fr: Aucun historique de commande pour le moment

# orderHistory_titleText
source: Order history
ar: سجل الطلبات
fr: Historique des commandes

# orderHistory.title
source: Order History
ar: سجل الطلبات

# orderId.title
source: Order ID
ar: معرّف الطلب

# OrderID.title
source: Order ID
ar: معرّف الطلب

# orderReceiptBottomSheet_address
source: Address
ar: العنوان
fr: Adresse

# orderReceiptBottomSheet_amount
source: Amount
ar: المبلغ
fr: Montant

# orderReceiptBottomSheet_companyName
source: Company Name
ar: اسم الشركة
fr: Nom de l’entreprise

# orderReceiptBottomSheet_datePaid
source: Date Paid
ar: تاريخ الدفع
fr: Date de paiement

# orderReceiptBottomSheet_download
source: Download
ar: تحميل
fr: Télécharger

# orderReceiptBottomSheet_email
source: Email
ar: البريد الإلكتروني

# orderReceiptBottomSheet_orderID
source: Order ID
ar: معرّف الطلب
fr: ID de commande

# orderReceiptBottomSheet_paymentMethod
source: Payment Method
ar: طريقة الدفع
fr: Méthode de paiement

# orderReceiptBottomSheet_product
source: Product
ar: المنتج
fr: Produit

# orderReceiptBottomSheet_qty
source: Qty
ar: الكمية
fr: Qté

# orderReceiptBottomSheet_summary
source: Summary
ar: ملخص
fr: Résumé

# orderReceiptBottomSheet_totalPaid
source: Total Paid
ar: المبلغ الإجمالي المدفوع
fr: Total payé

# orderReceiptBottomSheet_unitPrice
source: Unit Price
ar: سعر الوحدة
fr: Prix unitaire

# OrderStatus.title
source: Order Status
ar: حالة الطلب

# otp_channel_email_label
source: Via Email
ar: عبر البريد الإلكتروني

# otp_channel_selector_title
source: Send OTP via
ar: أرسل رمز التحقق عبر
fr: Envoyer l'OTP via

# otp_channel_sms_label
source: Via SMS
ar: عبر الرسائل القصيرة

# otp_page_subtitle_email
source: We sent a verification code to your email address
ar: أرسلنا رمز التحقق إلى بريدك الإلكتروني
fr: Nous avons envoyé un code de vérification à votre adresse email

# otp_page_subtitle_sms
source: We sent a verification code to your phone number
ar: أرسلنا رمز التحقق إلى رقم هاتفك
fr: Nous avons envoyé un code de vérification à votre numéro de téléphone

# otp_page_title_email
source: Check your email
ar: تحقق من بريدك الإلكتروني
fr: Vérifiez votre email

# otp_page_title_sms
source: Check your SMS
ar: تحقق من رسالتك القصيرة
fr: Vérifiez vos SMS

# otp_resend_try_again_later
source: Please wait a moment before requesting a new code
ar: يرجى الانتظار قليلاً قبل طلب رمز جديد
fr: Veuillez attendre un moment avant de demander un nouveau code

# otp_resend_via_email
source: Try via email instead
ar: جرّب عبر البريد الإلكتروني
fr: Essayer par email

# otp_resend_via_sms
source: Try via SMS instead
ar: جرّب عبر الرسائل القصيرة
fr: Essayer par SMS

# otp_send_failed_email
source: Failed to send OTP via Email, please try SMS instead
ar: فشل إرسال رمز التحقق عبر البريد الإلكتروني، يرجى تجربة الرسائل القصيرة
fr: Échec de l'envoi du code par email, veuillez essayer le SMS

# otp_send_failed_sms
source: Failed to send OTP via SMS, please try Email instead
ar: فشل إرسال رمز التحقق عبر الرسائل القصيرة، يرجى تجربة البريد الإلكتروني
fr: Échec de l'envoi du code par SMS, veuillez essayer l'email

# otp_validation_message
source: Pin should be at least
ar: ينبغي أن يكون الرمز
fr: Le code PIN doit contenir au moins

# otp_validation_message_numbers
source: numbers
ar: خانات
fr: chiffres

source: Password
ar: كلمه السر
fr: Mot de passe

source: Payment failed
ar: فشلت عملية الدفع
fr: Le paiement a échoué

# payment_success
source: Payment Successful
ar: تم الدفع بنجاح
fr: Paiement réussi

source: Payment was cancelled
ar: تم إلغاء عملية الدفع
fr: Le paiement a été annulé avec succès

# payment.successful.title
source: Payment done successfully
ar: تم الدفع بنجاح

# PaymentDetails.title
source: Payment Details
ar: تفاصيل الدفع

# PaymentMethod.title
source: Payment Method
ar: طريقة الدفع

# paymentSelection_cardText
source: Credit/Debit Card
ar: بطاقة الائتمان / الخصم
fr: Carte de crédit/débit

# paymentSelection_dcbText
source: Direct Carrier Billing
ar: الفوترة عبر مزود الخدمة
fr: Facturation directe opérateur

# paymentSelection_titleText
source: Choose Payment Method
ar: اختيار طريقة الدفع
fr: Choisissez le mode de paiement

# paymentSelection_walletText
source: Wallet
ar: محفظتي
fr: Portefeuille

# paymentSuccesspage_noQeShare
source: No QR code available to share
ar: لا يوجد رمز QR متاح للمشاركة
fr: Aucun code QR disponible à partager

# paymentSuccessPage_noQrDownload
source: No QR code available to download
ar: لا يوجد رمز QR متاح للتنزيل
fr: Aucun code QR disponible à télécharger

# paymentSuccessPage_QrSaved
source: QR code saved to Photos
ar: تم حفظ رمز QR في الصور
fr: Code QR enregistré dans Photos

# pdf.company.title
source: Company Details
ar: تفاصيل الشركة

# pdf.orderInfo.title
source: Order Information
ar: معلومات الطلب

# pdf.orderSummary.title
source: Order Summary
ar: ملخص الطلب

# pdf.payment.title
source: Payment Method
ar: طريقة الدفع

# pdf.price.title
source: Price
ar: سعر

# pdf.product.title
source: Product
ar: المنتج

# pdf.quantity.title
source: Quantity
ar: الكمية

source: Permission Required
ar: الإذن مطلوب
fr: Autorisation requise

# permission_required
source: Permission required: {permission}
ar: مطلوب إذن: {permission}
fr: Permission requise : {permission}

source: Phone number is ambiguous.
ar: رقم الهاتف غير صالح

# phoneInput_countryPlaceHolder
source: Enter country name
ar: أدخل اسم الدولة
fr: Entrez le nom du pays

# phoneInput_placeHolder
source: Phone number
ar: رقم الهاتف
fr: Numéro de téléphone

# phonelogin.title
source: Continue with Mobile Number
ar: المتابعة باستخدام رقم الهاتف

source: Photo library access is required to save images. Please enable it in Settings.
ar: مطلوب إذن الوصول إلى الصور لحفظ الصور. يرجى تفعيله من الإعدادات
fr: L’accès à la photothèque est requis pour enregistrer des images. Veuillez l’activer dans les réglages.

source: Plan History
ar: سجل حزمة البيانات
fr: Historique du forfait

# plan.history.title
source: Plan History
ar: سجل حزمة البيانات

# plans.title
source: Data Plans
ar: باقات البيانات
fr: Forfaits data

# PlanType.title
source: Plan Type
ar: نوع الخطة

source: Please enter a valid amount
ar: يرجى إدخال مبلغ صالح
fr: Veuillez entrer un montant valide

source: Please fill all required fields
ar: يرجى تعبئة جميع الحقول المطلوبة
fr: Veuillez remplir tous les champs obligatoires

source: Please choose contact number
ar: يرجى اختيار رقم الهاتف
fr: Veuillez choisir un numéro de contact

source: Please wait...
ar: أرجو الإنتظار...
fr: Veuillez patienter...

# Position_QR_Scanner
source: Position the QR code within the frame to scan
ar: ضع الرمز داخل الإطار للمسح
fr: Placez le QR dans le cadre pour scanner

source: Press Add eSIM
ar: اضغط على إضافة eSIM
fr: Appuyez sur Ajouter eSIM

source: Press Mobile Services
ar: اضغط على خدمات الهاتف المحمول
fr: Appuyez sur Services mobiles

# press_toggle_button
source: Press the toggle button next to Data Roaming to turn the function on or off
ar: اضغط على زر التبديل بجانب التجوال البيانات لتشغيله أو إيقافه
fr: Appuyez sur le bouton à bascule à côté de Itinérance des données pour activer ou désactiver la fonction

source: Press Use QR Code
ar: اضغط على استخدام رمز QR
fr: Appuyez sur Utiliser le code QR

# price.buy.title
source: %@ - Buy Now
ar: %@- اشتري الأن

source: Primary Bundle
ar: الحزمة الأساسية
fr: Offre Principale

source: Processing...
ar: جارٍ المعالجة...
fr: Traitement en cours...

# processing.title
source: Processing
ar: جاري المعالجة

# Product.title
source: Product
ar: المنتج

# profile_aboutUs
source: About Us
ar: نبذة عنَّا
fr: À propos de nous

# profile_account
source: Account
ar: الحساب
fr: Compte

# profile_accountInformation
source: Account Information
ar: معلومات الحساب
fr: Informations du compte

# profile_contactUs
source: Contact Us
ar: تواصل معنا
fr: Contactez-nous

# profile_currency
source: Currency
ar: العملة
fr: Devise

# profile_delete
source: Delete
ar: حذف
fr: Supprimer

# profile_faq
source: FAQ
ar: الأسئلة الشائعة

# profile_guest
source: Guest
ar: ضيف
fr: Invité

# profile_language
source: Language
ar: اللغة
fr: Langue

# profile_login
source: Log in
ar: تسجيل الدخول
fr: Se connecter

# profile_logout
source: Logout
ar: تسجيل الخروج
fr: Se déconnecter

# profile_myWallet
source: My Wallet
ar: محفظتي
fr: Mon portefeuille

# profile_orderHistory
source: Order History
ar: سجل الطلبات
fr: Historique des commandes

# profile_settings
source: Settings
ar: الإعدادات
fr: Paramètres

# profile_tabName
source: Profile
ar: الملف الشخصي
fr: Profil

# profile_termsConditions
source: Terms & Conditions
ar: الشروط والأحكام
fr: Conditions générales

# profile_userGuide
source: User Guide
ar: دليل المستخدم
fr: Guide de l’utilisateur

# profile_version
source: Version {version}({buildNumber})
ar: الإصدار {version}({buildNumber})

# profile.title
source: Profile
ar: الملف الشخصي

# PromoBox_PromoCode
source: Promo Code
ar: رمز ترويجي
fr: Code promo

# promoCodeView_buttonText
source: Apply Promo Code
ar: تطبيق الرمز الترويجي
fr: Appliquer le code promo

# promoCodeView_cancelButtonText
source: Cancel Promo Code
ar: إلغاء رمز العرض الترويجي
fr: Annuler le code promo

# promoCodeView_titleText
source: Apply Promo or Referral Code
ar: هل لديك رمز ترويجي؟
fr: Appliquer un code promo ou de parrainage

# purchase.now.title
source: Buy Now
ar: اشتري الأن

# purchase.title
source: Purchase Anyway
ar: شراء الآن

# purchased
source: Purchased {date}
ar: تم الشراء في {date}
fr: Acheté le {date}

source: QR Code
ar: رمز الاستجابة السريعة
fr: Code QR

source: QR Code Details
ar: تفاصيل رمز الاستجابة السريعة
fr: Détails du code QR

source: Qr Code Saved
ar: تم حفظ رمز QR
fr: Code QR enregistré

# qr.isgenerated.message
source: This may take a while...
ar: هذا قد يستغرق بعض الوقت...

# qr.isgenerated.title
source: The QR Code is being generated.
ar: يتم الأن إنشاء رمز الاستجابة السريعة

# qrcode.label
source: QR Code
ar: رمز الاستجابة السريعة

# qrcode.sent.title
source: The QR code was sent to your email
ar: تم إرسال رمز QR إلى بريدك الإلكتروني.

# qrcode.title
source: QR Code Details
ar: تفاصيل رمز الاستجابة السريعة

# qrcodeDetails_checkUserGuideText
source: Check User Guide
ar: اطلع على دليل المستخدم
fr: Guide utilisateur

# qrcodeDetails_titleText
source: The QR code was sent to your email, please scan it to install it on your phone. For detailed activation instructions, refer to the User Guide.
ar: تم إرسال رمز الاستجابة إلى بريدك الإلكتروني، يُرجى مسحه ضوئيًا لتثبيته على هاتفك. للحصول على تعليمات التنشيط التفصيلية، راجع دليل المستخدم.
fr: Le code QR a été envoyé à votre email, veuillez le scanner pour l’installer sur votre téléphone. Pour des instructions détaillées, consultez le guide utilisateur.

# QRScannerView.scantitle
source: Scan QR Code
ar: مسح رمز QR
fr: Scanner le code QR

# Qty.title
source: Qty
ar: الكمية

# receivenewsletters.title
source: and agree to receive newsletters and promotions.
ar: ، وتوافق على تلقي النشرات الاخبارية و العروض الترويجية
fr: et acceptez de recevoir des newsletters et des promotions.

# Redeem.Voucher.message
source: Enter the voucher code or scan the QR code to redeem into your eSIM wallet
ar: أدخل رمز القسيمة أو امسح رمز الاستجابة السريعة لاسترداده في محفظة eSIM

# redeemVoucher_enterCode
source: Enter Code
ar: أدخل الرمز
fr: Entrez le code

# RedeemVoucher.title
source: Redeem Voucher
ar: استرداد

# refer.friends.message
source: Once your friends successfully purchase their first eSIM using your referral code, you’ll receive a %@ USD reward in your Monty eSIM wallet.
ar: بمجرد أن يقوم أصدقاؤك بشراء أول شريحة eSIM باستخدام رمز الإحالة الخاص بك، ستحصل على مكافأة بنسبة %@ في محفظة Monty eSIM الخاصة بك.

# refer.friends.title
source: Refer Your Friends
ar: قم بإحالة أصدقائك

# refer.now.title
source: Refer Now
ar: الإحالة الآن

# refer.reel1.message
source: Invite your friends to experience Monty eSIM through the app.
ar: ادعُ أصدقائك للتجربة eSIM من خلال التطبيق.

# refer.reel1.title
source: Refer Your Friends
ar: قم بإحالة أصدقائك
